Revit API Introduction Labs
Lab3_1_StandardFamiliesAndTypes Class
 List all loaded standard families and types. As a result of the issues explained below, we implemented the LabUtils utility methods FamilyCategory and GetFamilies.
 In this section, we list all loaded families and family instances in the current document. Each family defines a set of types, also called symbols. The Revit API uses the ElementType to represent these types in a project file. Prior to the Revit 2011 API, the ElementType class was called Symbol.
 To list them, we retrieve all the family instances in the document. They represent the standard families loaded and available in the current model. Let's first see how we can get the family objects and try to determine their category. We have added a new module named Labs3 to the project and a standard command class implementation Lab3_1_StandardFamiliesAndTypes to it in which we implement this functionalty.
 Instantiate a filtered element collector for this document and retrieve all Family objects. Iterate over the result and list their Name, Category and FamilyCategory properties:
CopyC#
//
// retrieve all family elements in current document:
//
families = new FilteredElementCollector( doc );
families.OfClass( typeof( Family ) );
foreach( Family f in families )
{
  // Get its category name; notice that the Category property is not
  // implemented for the Family class; use FamilyCategory instead;
  // notice that that is also not always implemented; in that case,
  // use the workaround demonstrated below, looking at the contained
  // family symbols' category:
  a.Add( string.Format( "Name={0}; Category={1}; FamilyCategory={2}",
    f.Name,
    ( ( null == f.Category ) ? "?" : f.Category.Name ),
    ( ( null == f.FamilyCategory ) ? "?" : f.FamilyCategory.Name ) ) );
}
CopyVB.NET
'
' get all family elements in current document:
'
families = New FilteredElementCollector(doc)
families.OfClass(GetType(Family))
For Each f As Family In families
    ' Get its category name; notice that the Category property is not
    ' implemented for the Family class; use FamilyCategory instead;
    ' notice that that is also not always implemented; in that case,
    ' use the workaround demonstrated below, looking at the contained
    ' family symbols' category:
    a.Add("Name=" + f.Name _
          + "; Category=" + If(f.Category Is Nothing, "?", f.Category.Name) _
          + "; FamilyCategory=" + If(f.FamilyCategory Is Nothing, "?", f.FamilyCategory.Name))
Next
 Compile and run the command. As we can see from the message box, all the categories are listed as "?", showing that this property is not implemented for family class.
 Because the Category property is not implemented for family objects, and it is often useful to determine a family instance's category, the Revit API has defined an additional property FamilyCategory to query it. Unfortunately, the value of this property is defined in the content, and some legacy content does not specify a value for it, so even this property does not always reliably return the value you might expect.
 In order to reliably determine a family's category, we can retrieve the contained symbols or types and determine their category. The following code demonstrates this and also reports all types available in each family, displaying one message box per family.
CopyC#
catName = s.Category.Name;
CopyVB.NET
catName = s.Category.Name
 Now a valid category name is reported for all families. The looping continues displaying all types contained in each family in one message box each as long as you click 'OK'. Click 'Cancel' to terminate.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab3_1_StandardFamiliesAndTypes : IExternalCommand
Visual Basic (Declaration)
Public Class Lab3_1_StandardFamiliesAndTypes _
	Implements IExternalCommand
Visual C++
public ref class Lab3_1_StandardFamiliesAndTypes : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab3_1_StandardFamiliesAndTypes
See Also
Lab3_1_StandardFamiliesAndTypes Members
Labs Namespace